$ NASTRAN file exported by CADFEKO version 2019.3-365937 (x64)
$
$ Filename: E:/中科院/110年中科院/測試檔案/Triangle_test_8mesh_3 point theta0-90.nas
$ Date:     週六 十月 16 2021
$
$ Number of segments:             0
$           triangles:            8
$           cuboids:              0
$           tetrahedra:           0
GRID*                  1                  6.666666667E-2  0.000000000E+0       1
*      1  0.000000000E+0
GRID*                  2                  2.500000000E-2  2.500000000E-2       2
*      2  0.000000000E+0
GRID*                  3                  3.333333333E-2  0.000000000E+0       3
*      3  0.000000000E+0
GRID*                  4                  0.000000000E+0  0.000000000E+0       4
*      4  0.000000000E+0
GRID*                  5                  1.000000000E-1  0.000000000E+0       5
*      5  0.000000000E+0
GRID*                  6                  1.000000000E-1  3.333333333E-2       6
*      6  0.000000000E+0
GRID*                  7                  5.000000000E-2  5.000000000E-2       7
*      7  0.000000000E+0
GRID*                  8                  7.500000000E-2  7.500000000E-2       8
*      8  0.000000000E+0
GRID*                  9                  1.000000000E-1  6.666666667E-2       9
*      9  0.000000000E+0
GRID*                 10                  1.000000000E-1  1.000000000E-1      10
*     10  0.000000000E+0
CTRIA3         1   21172       3       2       1
CTRIA3         2   21172       4       2       3
CTRIA3         3   21172       6       5       1
CTRIA3         4   21172       7       1       2
CTRIA3         5   21172      10       9       8
CTRIA3         6   21172       6       7       8
CTRIA3         7   21172       6       1       7
CTRIA3         8   21172       6       8       9
ENDDATA